NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_ppr.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_ATBFUNNEL210">
      <name>GLOBAL_ATBFUNNEL211</name>
      <description>ATB funnel module 1</description>
      <baseAddress>0xBF04D000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_ATBFUNNEL210">
      <name>GLOBAL_ATBFUNNEL212</name>
      <description>ATB funnel module 2</description>
      <baseAddress>0xBF04E000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_ATBFUNNEL210">
      <name>GLOBAL_ATBFUNNEL213</name>
      <description>ATB funnel module 3</description>
      <baseAddress>0xBF04F000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
    </peripheral>
    <peripheral>
      <name>GLOBAL_GPR</name>
      <description>Granular Power Requester</description>
      <baseAddress>0xBF050000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>GPR</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>CPWRUPREQ</name>
          <description>Debug Power Request Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CPWRUPREQ_BIT0</name>
              <description>Bit 0 of the cpwrupreq output port.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>CPWRUPREQ_BIT1</name>
              <description>Bit 1 of the cpwrupreq output port.</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>CPWRUPREQ_BIT2</name>
              <description>Bit 2 of the cpwrupreq output port.</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>CPWRUPREQ_BIT3</name>
              <description>Bit 3 of the cpwrupreq output port.</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>CPWRUPREQ_BIT4</name>
              <description>Bit 4 of the cpwrupreq output port.</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>CPWRUPREQ_BIT5</name>
              <description>Bit 5 of the cpwrupreq output port.</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>CPWRUPREQ_BIT6</name>
              <description>Bit 6 of the cpwrupreq output port.</description>
              <lsb>6</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>CPWRUPREQ_BIT7</name>
              <description>Bit 7 of the cpwrupreq output port.</description>
              <lsb>7</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>CPWRUPREQ_BIT8</name>
              <description>Bit 8 of the cpwrupreq output port.</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CPWRUPACK</name>
          <description>Debug Power Acknowledge Register</description>
          <addressOffset>0x4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CPWRUPACK_BIT0</name>
              <description>Bit 0 of the cpwrupack input port.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>CPWRUPACK_BIT1</name>
              <description>Bit 1 of the cpwrupack input port.</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>CPWRUPACK_BIT2</name>
              <description>Bit 2 of the cpwrupack input port.</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>CPWRUPACK_BIT3</name>
              <description>Bit 3 of the cpwrupack input port.</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>CPWRUPACK_BIT4</name>
              <description>Bit 4 of the cpwrupack input port.</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>CPWRUPACK_BIT5</name>
              <description>Bit 5 of the cpwrupack input port.</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>CPWRUPACK_BIT6</name>
              <description>Bit 6 of the cpwrupack input port.</description>
              <lsb>6</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>CPWRUPACK_BIT7</name>
              <description>Bit 7 of the cpwrupack input port.</description>
              <lsb>7</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>CPWRUPACK_BIT8</name>
              <description>Bit 8 of the cpwrupack input port.</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ITCTRL</name>
          <description>Integration Mode Control Register</description>
          <addressOffset>0xF00</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>INTEGRATION_MODE</name>
              <description>When you read this register, CXGPR returns a zero because no integration functionality is implemented.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CLAIMSET</name>
          <description>Claim Tag Set Register</description>
          <addressOffset>0xFA0</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000000F</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLAIMSET</name>
              <description>On Read for each bit 1 means claim tag bit implemented. On Write for each bit 0 has no effect, 1 sets the relevant bit of the claim tag</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CLAIMCLR</name>
          <description>Claim Tag Clear Register</description>
          <addressOffset>0xFA4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLAIMCLR</name>
              <description>The value present reflects the present value of the Claim Tag.</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCKACCESS</name>
          <description>Lock Access Register</description>
          <addressOffset>0xFB0</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>LOCKACCESS</name>
              <description>When you write 0xC5ACCE55, subsequent write operations to this device are enabled. Any other value disables subsequent write operations.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCKSTATUS</name>
          <description>Lock Status Register</description>
          <addressOffset>0xFB4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000003</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>LOCKEXIST</name>
              <description>Indicates that a lock control mechanism is present in this device.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>LOCKGRANT</name>
              <description>Returns the present lock status of the device.</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>LOCKTYPE</name>
              <description>Indicates that the Lock Access Register is implemented as 32-bit.</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>AUTHSTATUS</name>
          <description>Authentication Status Register</description>
          <addressOffset>0xFB8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>NSID</name>
              <description>Indicates the security level for Non-Secure Invasive Debug.</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>NSNID</name>
              <description>Indicates the security level for Non-Secure Non-Invasive Debug.</description>
              <lsb>2</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>SID</name>
              <description>Indicates the security level for Secure Invasive Debug.</description>
              <lsb>4</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>SNID</name>
              <description>Indicates the security level for Secure Non-Invasive Debug.</description>
              <lsb>6</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVARCH</name>
          <description>Device Architecture Register</description>
          <addressOffset>0xFBC</addressOffset>
          <access>read-only</access>
          <resetValue>0x47700A34</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ARCHID</name>
              <description>Indicates the architecture of the component.</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>REVISION</name>
              <description>Indicates the revision of the architecture.</description>
              <lsb>16</lsb>
              <msb>19</msb>
            </field>
            <field>
              <name>PRESENT</name>
              <description>Indicates whether the DEVARCH register is present.</description>
              <lsb>20</lsb>
              <msb>20</msb>
            </field>
            <field>
              <name>ARCHITECT</name>
              <description>Indicates the JEP106 code pf the architect who specifies the architecture of the component. Bits [31:28] are the JEP106 continuation code. Bits [27:21] are the JEP106 identity code.</description>
              <lsb>21</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVID</name>
          <description>Device Configuration Register</description>
          <addressOffset>0xFC8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CPWRUPM_COUNT</name>
              <description>The value present in this field indicates the number of CPWRUP master interfaces available in CXGPR. Permitted range of values: 0x1 to 0x20.</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVTYPE</name>
          <description>Device Type Identifier Register</description>
          <addressOffset>0xFCC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000034</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MAJOR_TYPE</name>
              <description>Major classification of the type of the debug component as specified in the CoreSight Architecture Specification  for this debug and trace component.</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>SUB_TYPE</name>
              <description>Sub-classification of the type of the debug component as specified in the CoreSight Architecture Specification within the major classification as specified in the Major_Type field.</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PERIPHID4</name>
          <description>Peripheral ID4 Register</description>
          <addressOffset>0xFD0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000004</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DES_2</name>
              <description>This is the JEDEC JEP106 continuation code. This code along with, bits[6:4] of the identity code defined in PERIPHID0 register. and with bits[3:0] of the identity code defined in PERIPHID1 register, gives the designer of the component.</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>SIZE</name>
              <description>This is a 4-bit value that indicates the total contiguous size in powers of two of the memory window that this component uses  from the standard 4KB. If a component only requires the standard 4KB size then this reads as 0x0, for 8KB: 0x1, 16KB:0x2, 32KB: 0x3, until 128MB.</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PERIPHID0</name>
          <description>Peripheral ID0 Register</description>
          <addressOffset>0xFE0</addressOffset>
          <access>read-only</access>
          <resetValue>0x000000A4</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PART_0</name>
              <description>Bits [7:0] of the components 12 bit part number. The  designer of the component assigns this part number.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PERIPHID1</name>
          <description>Peripheral ID1 Register</description>
          <addressOffset>0xFE4</addressOffset>
          <access>read-only</access>
          <resetValue>0x000000B9</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PART_1</name>
              <description>Bits[11:8] of the components 12 bit part number. The  designer of the component assigns this part number.</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>DES_0</name>
              <description>Bits[3:0] of the JEDEC JEP106 identity code. This code, along with bits[6:4] of the identity code defined in PERIPHID2 register and the continuation code defined in PERIPHID4 register, gives the designer of the component.</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PERIPHID2</name>
          <description>Peripheral ID2 Register</description>
          <addressOffset>0xFE8</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000000B</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DES_1</name>
              <description>Bits[6:4] of the JEDEC JEP106 identity code. This code, along with bits[3:0] of the identity code defined in PERIPHID1 register and the continuation code defined in PERIPHID4 register, gives the designer of the component.</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>JEDEC</name>
              <description>Always set. Indicates if the JEDEC assigned designer ID is used.</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>REVISION</name>
              <description>An incremental value starting from 0x0 for the first revision of this component. This increases by 1 for both major and minor revisions and is used  to identify the major or minor revisions.</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PERIPHID3</name>
          <description>Peripheral ID3 Register</description>
          <addressOffset>0xFEC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CMOD</name>
              <description>Indicates if the customer modified the behavior of the component. In most cases, this field might be zero. The customer changes this value on modifications to this component.</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>REVAND</name>
              <description>Indicates minor errata fixes specific to the revision of the component being used, for example metal fixes after implementation. In most cases, this field might be zero. ARM recommends that the component designers ensure that a metal fix can change this field if required, for example, by driving it from registers that reset to zero.</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>COMPID0</name>
          <description>Component ID0 Register</description>
          <addressOffset>0xFF0</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000000D</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRMBL_0</name>
              <description>Contains bits[7:0] of the component identification code.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>COMPID1</name>
          <description>Component ID1 Register</description>
          <addressOffset>0xFF4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000090</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRMBL_1</name>
              <description>Contains bits [11:8] of the component identification</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>CLASS</name>
              <description>Class of the component, for example, if the component is a ROM table or a generic CoreSight component. Contains bits[15:12] of the component identification code.</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>COMPID2</name>
          <description>Component ID2 Register</description>
          <addressOffset>0xFF8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000005</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRMBL_2</name>
              <description>Contains bits [23:16] of the component identification</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>COMPID3</name>
          <description>Component ID3 Register</description>
          <addressOffset>0xFFC</addressOffset>
          <access>read-only</access>
          <resetValue>0x000000B1</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRMBL_3</name>
              <description>Contains bits [31:24] of the component identification</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
