NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_ppr.svd
          <register>
            <name>START</name>
            <description>Start shifting data for trim configuration.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>START</name>
                <description>Start trim configuration</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoOperation</name>
                    <description>No operation</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Start</name>
                    <description>Start trim config</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>KEY</name>
                <description>Key to enable the writing to this register.</description>
                <lsb>16</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Disable the writing to this register</description>
                    <value>0x0000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Enable the writing to this register</description>
                    <value>0xA66D</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>READY</name>
            <description>Status of shifting the MRAM trim configuration data.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000001</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>READY</name>
                <description>Shifting the MRAM trim configuration data is in progress or not.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Busy</name>
                    <description>Shifting the MRAM trim configuration data is in progress.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Ready</name>
                    <description>Ready for shifting the next MRAM trim configuration data.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DONE</name>
            <description>This register is used to indicate to the MRAMC that the whole MRAM trim 
                configuration data write is completed.</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TRIMCOMPLETED</name>
                <description>Trim configuration is completed.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <usage>read</usage>
                  <enumeratedValue>
                    <name>TrimUnknown</name>
                    <description>Read: Trim configuration is unknown</description>
                    <value>0x00000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TrimCompleted</name>
                    <description>Read: Trim configuration data write is completed.</description>
                    <value>0x00000001</value>
                  </enumeratedValue>
                </enumeratedValues>
                <enumeratedValues>
                  <usage>write</usage>
                  <enumeratedValue>
                    <name>TrimComplete</name>
                    <description>Write: Trim configuration data write is complete.</description>
                    <value>0xA66DA66D</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOperation</name>
                    <description>Write ignored for all other values than 0xA66DA66D.</description>
                    <value>0x00000000</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>CONFIGNVR</name>
          <description>Unspecified</description>
          <headerStructName>MRAMC_CONFIGNVR</headerStructName>
          <access>read-write</access>
          <addressOffset>0x580</addressOffset>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>PAGE[%s]</name>
            <description>Description collection: Configuration register for NVR page n</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFC00000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WEN</name>
                <description>Write enable.</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DisableWrite</name>
                    <description>Write is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EnableNormalWrite</name>
                    <description>Normal write is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EnableDirectWrite</name>
                    <description>Direct write is enabled</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EEN</name>
                <description>Erase enable.</description>
                <lsb>4</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DisableErase</name>
                    <description>Erase is disabled but read is allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EnablePageErase</name>
                    <description>Erase page and read are allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LOCK</name>
                <description>Enables the lock for this register.</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <modifiedWriteValues>oneToSet</modifiedWriteValues>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LockDisabled</name>
                    <description>Lock is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LockEnabled</name>
                    <description>Lock is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LREN</name>
                <description>Enable read access to the lower range of the NVR page, as defined by LRSIZE</description>
                <lsb>22</lsb>
                <msb>22</msb>
                <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Read is disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Read is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LWEN</name>
                <description>Enable write access to the lower range of the NVR page, as defined by LWSIZE</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Write is disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Write is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LRSIZE</name>
                <description>Size of part of the lower 2KB memory in the NVR page to disable read access</description>
                <lsb>24</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>LWSIZE</name>
                <description>Size of part of the lower 2KB memory in the NVR page to disable write access</description>
                <lsb>28</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
