NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_ppr.svd
            <register>
              <name>SPICTRLR0</name>
              <description>This register is used to control the serial data transfer in enhanced SPI mode of operation.</description>
              <addressOffset>0x0F4</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000A00</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>TRANSTYPE</name>
                  <description>Address and instruction transfer format.</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>TT0</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TT1</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TT2</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TT3</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>ADDRL</name>
                  <description>This bit defines Length of Address to be transmitted.</description>
                  <lsb>2</lsb>
                  <msb>5</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>ADDR_L0</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L4</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L8</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L12</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L16</name>
                      <description>Unspecified</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L20</name>
                      <description>Unspecified</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L24</name>
                      <description>Unspecified</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L28</name>
                      <description>Unspecified</description>
                      <value>0x7</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L32</name>
                      <description>Unspecified</description>
                      <value>0x8</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L36</name>
                      <description>Unspecified</description>
                      <value>0x9</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L40</name>
                      <description>Unspecified</description>
                      <value>0xA</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L44</name>
                      <description>Unspecified</description>
                      <value>0xB</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L48</name>
                      <description>Unspecified</description>
                      <value>0xC</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L52</name>
                      <description>Unspecified</description>
                      <value>0xD</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L56</name>
                      <description>Unspecified</description>
                      <value>0xE</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L60</name>
                      <description>Unspecified</description>
                      <value>0xF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>XIPMDBITEN</name>
                  <description>Mode bits enable in XIP mode.</description>
                  <lsb>7</lsb>
                  <msb>7</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>INSTL</name>
                  <description>Dual/Quad/Octal mode instruction length in bits.</description>
                  <lsb>8</lsb>
                  <msb>9</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INST_L0</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>INST_L4</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>INST_L8</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>INST_L16</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>WAITCYCLES</name>
                  <description>Wait cycles in Dual/Quad/Octal mode between control frames transmit and data reception.</description>
                  <lsb>11</lsb>
                  <msb>15</msb>
                </field>
                <field>
                  <name>SPIDDREN</name>
                  <description>SPI DDR Enable bit.</description>
                  <lsb>16</lsb>
                  <msb>16</msb>
                </field>
                <field>
                  <name>INSTDDREN</name>
                  <description>Instruction DDR Enable bit.</description>
                  <lsb>17</lsb>
                  <msb>17</msb>
                </field>
                <field>
                  <name>SPIRXDSEN</name>
                  <description>Read data strobe enable bit.</description>
                  <lsb>18</lsb>
                  <msb>18</msb>
                </field>
                <field>
                  <name>XIPDFSHC</name>
                  <description>Fix DFS for XIP transfers.</description>
                  <lsb>19</lsb>
                  <msb>19</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>XIPINSTEN</name>
                  <description>XIP instruction enable bit.</description>
                  <lsb>20</lsb>
                  <msb>20</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>SSICXIPCONTXFEREN</name>
                  <description>Enable continuous transfer in XIP mode.</description>
                  <lsb>21</lsb>
                  <msb>21</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>SPIDMEN</name>
                  <description>SPI data mask enable bit.</description>
                  <lsb>24</lsb>
                  <msb>24</msb>
                </field>
                <field>
                  <name>SPIRXDSSIGEN</name>
                  <description>Enable rxds signaling during address and command phase of Hyperbus transfer.</description>
                  <lsb>25</lsb>
                  <msb>25</msb>
                </field>
                <field>
                  <name>XIPMBL</name>
                  <description>XIP Mode bits length.</description>
                  <lsb>26</lsb>
                  <msb>27</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MBL_2</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MBL_4</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MBL_8</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MBL_16</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>XIPPREFETCHEN</name>
                  <description>Enables XIP pre-fetch functionality in DWC_ssi.</description>
                  <lsb>29</lsb>
                  <msb>29</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>CLKSTRETCHEN</name>
                  <description>Enables clock stretching capability in SPI transfers.</description>
                  <lsb>30</lsb>
                  <msb>30</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>DDRDRIVEEDGE</name>
              <description>This Register is valid only when SSIC_HAS_DDR is equal to 1.</description>
              <addressOffset>0x0F8</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>TDE</name>
                  <description>TXD Drive edge register which decided the driving edge of transmit data.</description>
                  <lsb>0</lsb>
                  <msb>7</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>XIPMODEBITS</name>
              <description>This register carries the mode bits which are sent in the XIP mode of operation after address phase.</description>
              <addressOffset>0x0FC</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>XIPMDBITS</name>
                  <description>XIP mode bits to be sent after address phase of XIP transfer.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>SSICXIPADDRESS</name>
            <description>Unspecified</description>
            <headerStructName>GLOBAL_EXMIF_CORE_SSICXIPADDRESS</headerStructName>
            <access>read-write</access>
            <addressOffset>0x100</addressOffset>
            <register>
              <name>XIPINCRINST</name>
              <description>This Register is valid only when SSIC_XIP_EN is equal to 1.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>INCRINST</name>
                  <description>XIP INCR transfer opcode.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>XIPWRAPINST</name>
              <description>This Register is valid only when SSIC_XIP_EN is equal to 1.</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>WRAPINST</name>
                  <description>XIP WRAP transfer opcode.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
