NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_ppr.svd
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write: writing a '1' sets pin to not retain; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN22</name>
              <description>Clear RETAIN for pin 22</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unretained</name>
                  <description>Read: pin not retained</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Retained</name>
                  <description>Read: pin retained</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write: writing a '1' sets pin to not retain; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN23</name>
              <description>Clear RETAIN for pin 23</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unretained</name>
                  <description>Read: pin not retained</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Retained</name>
                  <description>Read: pin retained</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write: writing a '1' sets pin to not retain; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN24</name>
              <description>Clear RETAIN for pin 24</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unretained</name>
                  <description>Read: pin not retained</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Retained</name>
                  <description>Read: pin retained</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write: writing a '1' sets pin to not retain; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN25</name>
              <description>Clear RETAIN for pin 25</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unretained</name>
                  <description>Read: pin not retained</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Retained</name>
                  <description>Read: pin retained</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write: writing a '1' sets pin to not retain; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN26</name>
              <description>Clear RETAIN for pin 26</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unretained</name>
                  <description>Read: pin not retained</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Retained</name>
                  <description>Read: pin retained</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write: writing a '1' sets pin to not retain; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN27</name>
              <description>Clear RETAIN for pin 27</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unretained</name>
                  <description>Read: pin not retained</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Retained</name>
                  <description>Read: pin retained</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write: writing a '1' sets pin to not retain; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN28</name>
              <description>Clear RETAIN for pin 28</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unretained</name>
                  <description>Read: pin not retained</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Retained</name>
                  <description>Read: pin retained</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write: writing a '1' sets pin to not retain; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN29</name>
              <description>Clear RETAIN for pin 29</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unretained</name>
                  <description>Read: pin not retained</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Retained</name>
                  <description>Read: pin retained</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write: writing a '1' sets pin to not retain; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN30</name>
              <description>Clear RETAIN for pin 30</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unretained</name>
                  <description>Read: pin not retained</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Retained</name>
                  <description>Read: pin retained</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write: writing a '1' sets pin to not retain; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN31</name>
              <description>Clear RETAIN for pin 31</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unretained</name>
                  <description>Read: pin not retained</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Retained</name>
                  <description>Read: pin retained</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write: writing a '1' sets pin to not retain; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x20</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PIN_CNF[%s]</name>
          <description>Description collection: Pin n configuration of GPIO pin</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DIR</name>
              <description>Pin direction. Same physical register as DIR register</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Configure pin as an input pin</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Configure pin as an output pin</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INPUT</name>
              <description>Connect or disconnect input buffer</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Connect</name>
                  <description>Connect input buffer</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disconnect</name>
                  <description>Disconnect input buffer</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULL</name>
              <description>Pull configuration</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No pull</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pulldown</name>
                  <description>Pull down on pin</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pullup</name>
                  <description>Pull up on pin</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRIVE0</name>
              <description>Drive configuration for '0'</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S0</name>
                  <description>Standard '0'</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>H0</name>
                  <description>High drive '0'</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D0</name>
                  <description>Disconnect '0'(normally used for wired-or connections)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>E0</name>
                  <description>Extra high drive '0'</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRIVE1</name>
              <description>Drive configuration for '1'</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S1</name>
                  <description>Standard '1'</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>H1</name>
                  <description>High drive '1'</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D1</name>
                  <description>Disconnect '1'(normally used for wired-or connections)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>E1</name>
                  <description>Extra high drive '1'</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SENSE</name>
              <description>Pin sensing mechanism</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Sense for high level</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Sense for low level</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLOCKPIN</name>
              <description>Enable clock on the pin.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Clock disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Clock enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
